export const LRT_API = 'https://rt.data.gov.hk/v1/transport/mtr/lrt/getSchedule';

export const LRT_STNS = [
  {id:'003',n:'屯門',lat:22.394,lng:113.977},{id:'004',n:'三聖',lat:22.378,lng:113.969},
  {id:'005',n:'兆禧',lat:22.399,lng:113.959},{id:'006',n:'友愛',lat:22.388,lng:113.974},
  {id:'007',n:'南昌',lat:22.383,lng:113.973},{id:'009',n:'田景',lat:22.408,lng:113.975},
  {id:'010',n:'美樂',lat:22.413,lng:113.975},{id:'012',n:'天逸',lat:22.416,lng:113.972},
  {id:'013',n:'天水圍',lat:22.447,lng:114.008},{id:'014',n:'天澤',lat:22.444,lng:114.004},
  {id:'016',n:'天恩',lat:22.439,lng:114.000},{id:'017',n:'天富',lat:22.435,lng:113.996},
  {id:'018',n:'天華',lat:22.429,lng:113.993},{id:'020',n:'天瑞',lat:22.423,lng:113.990},
  {id:'021',n:'元朗',lat:22.444,lng:114.022},{id:'022',n:'教育路',lat:22.448,lng:114.023},
  {id:'024',n:'朗屏',lat:22.449,lng:114.031},{id:'025',n:'頌大',lat:22.456,lng:114.033},
  {id:'027',n:'兆康',lat:22.411,lng:113.968},{id:'029',n:'業旺',lat:22.407,lng:113.964},
  {id:'030',n:'翠豐',lat:22.404,lng:113.961},{id:'031',n:'青松',lat:22.415,lng:113.957},
];

export const LRT_ROUTES_DATA = {
  '505':{circular:true,desc:'天水圍循環綫',from:'天恩',to:'天恩',stops:[{id:'016',n:'天恩'},{id:'014',n:'天澤'},{id:'013',n:'天水圍'},{id:'020',n:'天瑞'},{id:'017',n:'天富'},{id:'018',n:'天華'},{id:'016',n:'天恩'}]},
  '507':{desc:'元朗─屯門南',from:'元朗',to:'屯門',stops:[{id:'021',n:'元朗'},{id:'022',n:'教育路'},{id:'024',n:'朗屏'},{id:'025',n:'頌大'},{id:'027',n:'兆康'},{id:'029',n:'業旺'},{id:'030',n:'翠豐'},{id:'006',n:'友愛'},{id:'007',n:'南昌'},{id:'003',n:'屯門'}]},
  '610':{desc:'屯門市中心─兆康',from:'屯門',to:'青松',stops:[{id:'003',n:'屯門'},{id:'007',n:'南昌'},{id:'006',n:'友愛'},{id:'027',n:'兆康'},{id:'029',n:'業旺'},{id:'030',n:'翠豐'},{id:'031',n:'青松'}]},
  '614':{desc:'屯門碼頭─元朗',from:'屯門',to:'元朗',stops:[{id:'003',n:'屯門'},{id:'004',n:'三聖'},{id:'007',n:'南昌'},{id:'006',n:'友愛'},{id:'027',n:'兆康'},{id:'029',n:'業旺'},{id:'025',n:'頌大'},{id:'022',n:'教育路'},{id:'021',n:'元朗'}]},
  '614P':{desc:'屯門碼頭─元朗(特別班)',from:'屯門',to:'元朗',stops:[{id:'003',n:'屯門'},{id:'004',n:'三聖'},{id:'007',n:'南昌'},{id:'006',n:'友愛'},{id:'027',n:'兆康'},{id:'029',n:'業旺'},{id:'025',n:'頌大'},{id:'022',n:'教育路'},{id:'021',n:'元朗'}]},
  '615':{desc:'屯門碼頭─天水圍',from:'屯門',to:'天水圍',stops:[{id:'003',n:'屯門'},{id:'004',n:'三聖'},{id:'007',n:'南昌'},{id:'006',n:'友愛'},{id:'027',n:'兆康'},{id:'018',n:'天華'},{id:'017',n:'天富'},{id:'020',n:'天瑞'},{id:'013',n:'天水圍'}]},
  '615P':{desc:'屯門碼頭─天水圍(特別班)',from:'屯門',to:'天水圍',stops:[{id:'003',n:'屯門'},{id:'004',n:'三聖'},{id:'007',n:'南昌'},{id:'006',n:'友愛'},{id:'027',n:'兆康'},{id:'018',n:'天華'},{id:'017',n:'天富'},{id:'020',n:'天瑞'},{id:'013',n:'天水圍'}]},
  '705':{circular:true,desc:'天水圍循環綫(順時)',from:'天水圍',to:'天水圍',stops:[{id:'013',n:'天水圍'},{id:'016',n:'天恩'},{id:'018',n:'天華'},{id:'017',n:'天富'},{id:'020',n:'天瑞'},{id:'013',n:'天水圍'}]},
  '706':{circular:true,desc:'天水圍循環綫(逆時)',from:'天水圍',to:'天水圍',stops:[{id:'013',n:'天水圍'},{id:'020',n:'天瑞'},{id:'017',n:'天富'},{id:'018',n:'天華'},{id:'016',n:'天恩'},{id:'013',n:'天水圍'}]},
  '751':{desc:'天水圍─元朗',from:'天水圍',to:'元朗',stops:[{id:'013',n:'天水圍'},{id:'014',n:'天澤'},{id:'016',n:'天恩'},{id:'024',n:'朗屏'},{id:'022',n:'教育路'},{id:'021',n:'元朗'}]},
  '751P':{desc:'天水圍─元朗(特別班)',from:'天水圍',to:'元朗',stops:[{id:'013',n:'天水圍'},{id:'014',n:'天澤'},{id:'016',n:'天恩'},{id:'024',n:'朗屏'},{id:'022',n:'教育路'},{id:'021',n:'元朗'}]},
  '761P':{desc:'天水圍─屯門碼頭(特別班)',from:'天水圍',to:'屯門',stops:[{id:'013',n:'天水圍'},{id:'020',n:'天瑞'},{id:'017',n:'天富'},{id:'018',n:'天華'},{id:'027',n:'兆康'},{id:'009',n:'田景'},{id:'010',n:'美樂'},{id:'012',n:'天逸'},{id:'006',n:'友愛'},{id:'007',n:'南昌'},{id:'003',n:'屯門'}]},
};
